# Status Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageType..::..Status Property
ImageType Class See Also
---
The status of the image
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ImageTypeStatus Status { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Status As ImageTypeStatus
	Get
```

Visual C++
---
```text
public:
property ImageTypeStatus Status {
	ImageTypeStatus get ();
}
```

# See Also
ImageType Class
Autodesk.Revit.DB Namespace